Tekla.Structures.Analysis.AnalysisSupport
The AnalysisSupport class contains information related to analysis supports.

Tekla.Structures.Analysis.AnalysisSupport.NUMBER_OF_DOF
The number of degrees of freedom of the connectivity.

Tekla.Structures.Analysis.AnalysisSupport._Support
The support types of the connectivity.

Tekla.Structures.Analysis.AnalysisSupport._Spring
The spring values of the connectivity.

Tekla.Structures.Analysis.AnalysisSupport.Spring
The spring values of the connectivity.

Tekla.Structures.Analysis.AnalysisSupport.Support
The connectivity type of the connectivity.